<?php

return [
    'code' => [
        'zh_cn' => [
            '-1'    => '系统繁忙，请稍候再试',
            '0'     => '请求成功',
            '10001' => '缺少token或token无效',
            '10002' => '缺少timestamp参数',
            '10003' => '缺少source参数',
            '10004' => '缺少sign参数',
            '10005' => '签名不合法',

            '40000' => '参数不合法',
            '40001' => 'page必须是整形!',
            '40002' => 'page_size必须是整形!',

            '41001' => 'seller_id不能为空',
            '41002' => 'product_id不能为空',
            '41003' => 'product_attribute_id不能为空',
            '41004' => 'address_id不能为空!',
            '41005' => 'country不能为空!',
            '41006' => 'state不能为空!',
            '41007' => 'city不能为空!',
            '41008' => 'address1不能为空!',
            '41009' => 'phone不能为空!',
            '41010' => 'customer_id不能为空!',

            '42001' => 'seller_id必须是整形!',
            '42002' => 'product_id必须是整形!',
            '42003' => 'product_attribute_id必须是整形!',
            '42004' => 'address_id必须是整形!',
            '42005' => '是否设置默认地址状态只能为0或1!',
            '42006' => 'customer_id必须是整形!',

        ]
    ]
];