<?php

return [
    'code' => [
        'en' => [
            '20000' => '获取商品详情失败',
            '20001' => '获取商品列表失败',
        ],
        'zh_cn' => [
            '-1' => '系统繁忙，请稍候再试',
            '0' => '请求成功',
            '40000' => '参数不合法',
            '40001' => '缺少token或token无效',
            '40002' => '签名不合法',
            '40003' => '不合法的timestamp',
            '40004' => '不合法的source',
            '40005' => '验签失败',

            '20000' => '获取商品详情失败',
            '20001' => '获取商品列表失败',
        ]
    ]
];